app/controllers/fotos_controller.rb

  def index
    @fotos = Foto.all
---
SELECT `fotos`.* FROM `fotos`

  def create
    @foto = Foto.new(foto_params)

    respond_to do |format|
      if @foto.save
---
INSERT INTO `fotos` (`created_at`, `nome`, `retrato_content_type`, `retrato_file_name`, `retrato_file_size`, `retrato_updated_at`, `updated_at`) VALUES ('2014-08-23 14:38:40', 'Julia', 'image/jpeg', 'ruiva-ruiva.jpg', 150365, '2014-08-23 14:38:38', '2014-08-23 14:38:40')

  def update
    respond_to do |format|
      if @foto.update(foto_params)
---
UPDATE `fotos` SET `nome` = 'Julia Strömdorm Akerfeldt', `retrato_file_name` = '17.jpg', `retrato_file_size` = 86016, `retrato_updated_at` = '2014-08-23 16:02:13', `updated_at` = '2014-08-23 16:02:18' WHERE `fotos`.`id` = 2

  def destroy
    @foto.destroy
---
DELETE FROM `fotos` WHERE `fotos`.`id` = 1

    def set_foto
      @foto = Foto.find(params[:id])
---
SELECT  `fotos`.* FROM `fotos`  WHERE `fotos`.`id` = 2 LIMIT 1