app/controllers/slider_controller.rb

	def index
		@fotos = Foto.all
---
SELECT `fotos`.* FROM `fotos`